#### Terraform Plan 📝
```

random_password.valid_token: Refreshing state... [id=none]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=990ef3277199c3ccac0f552dc1fb9de8d61466ce]
data.aws_eks_cluster_auth.auth: Reading...
data.aws_iam_role.lab_role: Reading...
data.aws_eks_cluster.cluster: Reading...
aws_ssm_parameter.valid_token_ssm: Refreshing state... [id=/ordering-system/apigateway/token]
aws_api_gateway_rest_api.api: Refreshing state... [id=6zeset6szf]
data.aws_eks_cluster_auth.auth: Read complete after 0s [id=ordering-eks-cluster]
data.aws_iam_role.lab_role: Read complete after 0s [id=LabRole]
aws_lambda_function.authorizer: Refreshing state... [id=api-authorizer]
aws_api_gateway_resource.proxy: Refreshing state... [id=clgpje]
data.aws_eks_cluster.cluster: Read complete after 0s [id=ordering-eks-cluster]
data.kubernetes_service.app_loadbalancer_service: Reading...
aws_api_gateway_authorizer.lambda_auth: Refreshing state... [id=tfwi04]
aws_lambda_permission.apigw_authorizer_invoke: Refreshing state... [id=AllowAPIGatewayInvokeAuthorizer]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-6zeset6szf-clgpje-ANY]
data.kubernetes_service.app_loadbalancer_service: Read complete after 1s [id=default/svc-app-loadbalancer]
aws_api_gateway_integration.proxy: Refreshing state... [id=agi-6zeset6szf-clgpje-ANY]
aws_api_gateway_deployment.api: Refreshing state... [id=tty6zd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_stage.api_stage will be created
  + resource "aws_api_gateway_stage" "api_stage" {
      + arn           = (known after apply)
      + deployment_id = "tty6zd"
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + region        = "us-east-1"
      + rest_api_id   = "6zeset6szf"
      + stage_name    = "dev"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

*Pusher: @jharoldo, Action: `pull_request`*